# CutLinePatternId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..CutLinePatternId Property
OverrideGraphicSettings Class See Also
---
ElementId of the cut surface line pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId CutLinePatternId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CutLinePatternId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ CutLinePatternId {
	ElementId^ get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace